{"status":"success","totalResults":4594,"results":[{"title":"MKBJYWS asks DC Ganderbal to make elaborate arrangements for pilgrims","link":"https://www.dailyexcelsior.com/mkbjyws-asks-dc-ganderbal-to-make-elaborate-arrangements-for-pilgrims/","keywords":["State"],"creator":["Daily Excelsior"],"video_url":null,"description":"Excelsior Correspondent JAMMU, May 24:Mata Kheer Bhawani Ji Yatra Welfare Society (MKBJYWS) has appealed the members of Hindu community to participate in large numbers in this year’s Mata Kheer Bhawani Mela falling on May 28 (Jesht Ashtami). The appeal was made by convener, MKBJYWS, Kiran Watal while talking to reporters here, today. He appealed the Kheer Bhawani bound yatris to reach Nagrota at 6 am on May 26 for departure to holy shrine in Tulmulla Ganderbal and other shrines of […] The post MKBJYWS asks DC Ganderbal to make elaborate arrangements for pilgrims appeared first on Jammu Kashmir Latest News | Tourism | Breaking News J&K.","content":"MKBJYWS office bearers at a press conference at Jammu on Wednesday. —Excelsior/Rakesh Excelsior Correspondent JAMMU, May 24:Mata Kheer Bhawani Ji Yatra Welfare Society (MKBJYWS) has appealed the members of Hindu community to participate in large numbers in this year’s Mata Kheer Bhawani Mela falling on May 28 (Jesht Ashtami). The appeal was made by convener, MKBJYWS, Kiran Watal while talking to reporters here, today. He appealed the Kheer Bhawani bound yatris to reach Nagrota at 6 am on May 26 for departure to holy shrine in Tulmulla Ganderbal and other shrines of Mata in Kashmir Valley. Watal has appealed the Deputy Commissioner Ganderbal on behalf of the Society to make elaborate arrangements including parking space as well as tented accommodation and urged the administration to be ready to cope with any situation in case of bad weather conditions. Watal said MKBJYWS an initiative of Vishaw Kashmiri Samaj (VKS) has been coordinating with official authorities for smooth conduct of the annual yatra of Mata Kheer Bhawani. Its delegation has recently met the Divisional Commissioner, Jammu, Ramesh Kumar and ADGP, Jammu, Mukesh Singh as well as Divisional Commissioner, Kashmir regarding smooth conduct of annual yatra to holy shrine on Jesht Ashtami. Both the Divisional Commissioners passed instructions to concerned DCs to make elaborate arrangements for the holy yatra. MKBJYWS also complimented Relief and Rehabilitation Commissioner, K K Sidha and his team for making elaborate arrangements for yatra. It also complimented DC Ramban for his cooperation. The Society lauded the role of R S Langeh president and Ashok Sharma secretary J&K Dharmarth Trust for their cooperation. The Trust has already done cleaning , painting and made other necessary arrangements and allied works at the holy shrine. Watal was flanked by Rajesh Gupta, chairman Tourism Federation, Jammu, M K Yogi senior KP leader of the Society and Pinto Ji chief coordinator. Watal said that the Society has also appointed M K Yogi as general secretary of VKS. He said VKS is a frontal and a social organisation of Kashmir Pandits and it has taken many initiatives for the welfare of KPs. It has been fighting for compensation for left over properties, release of balance ex-gratia , evacuation of encroached land, Passage of Temples and Shrines Bill, constitution of SIT to find out the causes that led to genocide of Kashmiri Pandits and punishment to guilty, accommodation to all PM package and other Hindu employees in Valley, compensation to over aged youth, enhancement of relief, compensation to traders, industrialists, orchardists and agriculturists of community for losses suffered by them, rehabilitation of community in Valley in accordance to its geo-political aspirations etc. Others present included Dr T K Bhat, B L Dhar, Rakesh Koul, M K Bhat, Rajesh Labroo, Bittu Ji, Ajay Bhat, Avtar Ji, Roshan Lal Koul, M K Padroo, Santosh Pandita, Ram Rattan, Sumit Bhan, M L Padroo, Chandra Dhar etc.","pubDate":"2023-05-24 22:26:30","image_url":null,"source_id":"dailyexcelsior","category":["top"],"country":["india"],"language":"english"},{"title":"Tribute paid to Yasho Rajya Lakshmi on her death anniversary","link":"https://www.dailyexcelsior.com/tribute-paid-to-yasho-rajya-lakshmi-on-her-death-anniversary/","keywords":["State"],"creator":["Daily Excelsior"],"video_url":null,"description":"Excelsior Correspondent JAMMU, May 24: Glorious tribute were paid to Yasho Rajya Lakshmi, wife of Dr Karan Singh, Chairman Trustee of J&K Dharmarth Trust, in a programme organised at Karaneshwar Temple in the premises of Raghunath ji Temple Jammu. On the occasion, Ajatshatru Singh, Trustee along with his wife Dr Ritu Singh and Ranvijay Singh, Trustee, performed Pooja at Karaneshwar Temple and prayed for the eternal peace to the departed soul. Speaking on the occasion, Ajatshatru Singh said that though […] The post Tribute paid to Yasho Rajya Lakshmi on her death anniversary appeared first on Jammu Kashmir Latest News | Tourism | Breaking News J&K.","content":"Ajatshatru Singh alongwith his wife Ritu Singh & son Ranvijay Singh performing Pooja for paying tribute to his mother Yasho Rajya Lakshmi on her death anniversary on Wednesday. Excelsior Correspondent JAMMU, May 24: Glorious tribute were paid to Yasho Rajya Lakshmi, wife of Dr Karan Singh, Chairman Trustee of J&K Dharmarth Trust, in a programme organised at Karaneshwar Temple in the premises of Raghunath ji Temple Jammu. On the occasion, Ajatshatru Singh, Trustee along with his wife Dr Ritu Singh and Ranvijay Singh, Trustee, performed Pooja at Karaneshwar Temple and prayed for the eternal peace to the departed soul. Speaking on the occasion, Ajatshatru Singh said that though Yasho Rajya Lakshmi left the world but she has made a permanent place in the hearts of the people of Jammu and Kashmir. “She will be remembered by the people for centuries together for playing a significant role during the transformation of the state from feudalism to democracy. She dedicated her life for the welfare of women folk and contributed a lot for the promotion of Dogra, Kashmiri and Ladakhi Culture and her noble deeds have remained as a driving force inspiring the women folk of the State,” he maintained.","pubDate":"2023-05-24 22:25:30","image_url":null,"source_id":"dailyexcelsior","category":["top"],"country":["india"],"language":"english"},{"title":"BJP destroying foundations of democracy in India: Bhalla","link":"https://www.dailyexcelsior.com/bjp-destroying-foundations-of-democracy-in-india-bhalla/","keywords":["State"],"creator":["Daily Excelsior"],"video_url":null,"description":"Excelsior Correspondent JAMMU, May 24: Working President of JKPCC and former minister Raman Bhalla today alleged that BJP Government has been destroying the foundations of democracy in the country. He said Jammu and Kashmir lost its identity under BJP and appealed to the people to support Congress in the fight for the restoration of statehood. He said BJP regime has destroyed Jammu and Kashmir in various spheres, as it lost its identity, status, right over jobs, lands, opportunities of trade […] The post BJP destroying foundations of democracy in India: Bhalla appeared first on Jammu Kashmir Latest News | Tourism | Breaking News J&K.","content":"Senior Cong leader Raman Bhalla interacting with people in Jammu South. Excelsior Correspondent JAMMU, May 24: Working President of JKPCC and former minister Raman Bhalla today alleged that BJP Government has been destroying the foundations of democracy in the country. He said Jammu and Kashmir lost its identity under BJP and appealed to the people to support Congress in the fight for the restoration of statehood. He said BJP regime has destroyed Jammu and Kashmir in various spheres, as it lost its identity, status, right over jobs, lands, opportunities of trade and transport and business besides whatsoever selections and recruitment were done in the UT, witnessed corruption and scams. Bhalla was interacting with aggrieved people of Ward-45 Digiana in Udham Singh Nagar in Jammu South RS Pura Constituency on Wednesday. Speaking on the occasion, Bhalla said that people have been exploited in the name of a bright future, control prices, and two crore jobs annually. But all their promises have fallen flat, except politics of hate and division. He said that Jammu and Kashmir was a historical state with much better living conditions than most states in the country, but now it has been pushed into an atmosphere of political uncertainty. Bhalla said the more delay in restoring statehood was bound to cause more disconnect between Centre and JK people, who were feeling hurt after the Centre’s move to downgrade the historical and full-fledged State into two Union Territories without their consent. “BJP government at the Centre is out to destroy the very foundation of the democracy in the country as it has done in Jammu and Kashmir aiming to rule it through remote control,” he said. The Congress leader further said Jammu and Kashmir is the “victim of wrong policies” of the BJP government which first dissolved the state legislature “to muzzle the voice, then not allowed the elections to happen till date in order to hide its nefarious agenda aiming to rule J&K through remote control, so that no genuine voice would emanate from the ground”. Prominent among those present on the occasion include Shashi Syal, Dr ML Bral, Shyal Singh, Balbir Singh, Trishan Bhagat, Jasbir Singh and others.","pubDate":"2023-05-24 22:24:30","image_url":null,"source_id":"dailyexcelsior","category":["top"],"country":["india"],"language":"english"},{"title":"J&K Dairy Farmers Association highlights achievements, demands","link":"https://www.dailyexcelsior.com/jk-dairy-farmers-association-highlights-achievements-demands/","keywords":["State"],"creator":["Daily Excelsior"],"video_url":null,"description":"Excelsior Correspondent JAMMU, May 24: On completion of an year since its formation, Jammu & Kashmir Dairy Farmers Association today highlighted its achievements and demands seeking Government help for further promotion of dairy sector in J&K. While talking to media persons, here today, President of JKDFA, Kulbhushan Khajuria demanded that infrastructure should be developed for cattle mandi; one in Kashmir and other in Jammu, so that the local breeder and Rastriya Gokul Mission Scheme are made successful and the young […] The post J&K Dairy Farmers Association highlights achievements, demands appeared first on Jammu Kashmir Latest News | Tourism | Breaking News J&K.","content":"J&K Dairy Farmers Association office bearers addressing a press conference at Jammu on Wednesday. Excelsior Correspondent JAMMU, May 24: On completion of an year since its formation, Jammu & Kashmir Dairy Farmers Association today highlighted its achievements and demands seeking Government help for further promotion of dairy sector in J&K. While talking to media persons, here today, President of JKDFA, Kulbhushan Khajuria demanded that infrastructure should be developed for cattle mandi; one in Kashmir and other in Jammu, so that the local breeder and Rastriya Gokul Mission Scheme are made successful and the young entrepreneurs are encouraged in the dairy sector. He also demanded setting up two big cattle hospitals, one each at Jammu and Kashmir with advanced technologies and the facility of cattle pregnancy diagnose test. “The cattle pregnancy diagnose test is conducted by private labs in Punjab, which charge Rs 300 for a cattle and this test is done within 28 days of pregnancy. We request the Government to facilitate the dairy farmers in J&K by providing the same testing facility either through SKUAST Jammu or Animal Husbandry Department,” he said. The Association President also demanded that there should be no ceiling on the number of cattle to be insured. Pointing out that the Govt scheme for dairy development has the provision of insurance policy for only 5 cattle of one dairy, Mr Khajuria reiterated that there should be no ceiling on the number of cattle to be insured. Ajit Rai Choudhary, Chairman of JKDFA announced that the Association has successfully completed membership drive in 80 percent of the districts in Jammu Kashmir Union Territory in the journey of one year. “With the support of Govt, we were able to change JK UT as milk sufficient from milk deficit state. It started with the demand for justice for the farmers for which a big protest was held at the front of JKMPCL Ltd against their monopoly in the milk procurement centre. Resultantly, IKMPCL Ltd has hiked their rates five times since then and a significant change in their behavior with the farmers has been witnessed,” he said. While listing achievements of the Association, Ajit Raj Choudhary drew attention towards organization of Ist big cattle show of JKUT and launch of Nestle in Jammu, which helped dairy farmers to export milk to other states. Sukhdev Choudhary, Surjeet Singh and other office bearers of the Association were also present during the press conference.","pubDate":"2023-05-24 22:23:30","image_url":null,"source_id":"dailyexcelsior","category":["top"],"country":["india"],"language":"english"},{"title":"DC Baramulla listens public issues, demands","link":"https://www.dailyexcelsior.com/dc-baramulla-listens-public-issues-demands/","keywords":["State"],"creator":["Daily Excelsior"],"video_url":null,"description":"Excelsior Correspondent BARAMULLA, May 24: Continuing the weekly Block Diwas programme, the Deputy Commissioner (DC) Baramulla, Dr Syed Sehrish Asgar today presided over a day long public outreach programme at Kanispora Panchayat here. Different stakeholders including PRIs, civil society members, among other prominent citizens of the area attended the programme in large numbers and flagged-off various demands, requirements and issues of public importance. The delegations from different areas put forth their issues and grievances which include macadamization of roads at […] The post DC Baramulla listens public issues, demands appeared first on Jammu Kashmir Latest News | Tourism | Breaking News J&K.","content":"DC Baramulla distributing equipment during Block Diwas Programme. Excelsior Correspondent BARAMULLA, May 24: Continuing the weekly Block Diwas programme, the Deputy Commissioner (DC) Baramulla, Dr Syed Sehrish Asgar today presided over a day long public outreach programme at Kanispora Panchayat here. Different stakeholders including PRIs, civil society members, among other prominent citizens of the area attended the programme in large numbers and flagged-off various demands, requirements and issues of public importance. The delegations from different areas put forth their issues and grievances which include macadamization of roads at Delina Panchayat Halqa, completion of drainage at Kanispora, playground at Kanispora to be developed and dedicated to youth of the area, Gohan Chandoosa road upgradation, repairing of landsliding of road at Katyanwali and other issues of pivotal importance. The DC gave patient hearing to all the demands and grievances and assured that all issues shall be taken with the concerned authorities for their timely redressal. While interacting with the public, the DC urged upon them to play an active part so that inclusive and public oriented projects and schemes are framed in larger public interest. She also assured PRIs and others that the issues and demands that they have put forth and registered will be seriously looked into. Moreover, the DC also gave on spot directions for redressal of many issues. During the programme, Dr Sehrish also inaugurated a library for students in Panchayat Kanispora aimed at helping them in getting the requisite arrangements of books and other related material. Meanwhile during the programme, Dr Sehrish also deliberated on the Holistic Agriculture Development Programme being carried out across the district. She urged the representatives of PRIs and other stakeholders to ensure larger participation throughout the three-month-long Abhiyan to avail benefits under HADP. The District Administration is committed to support people for holistic development, she added. Moreover, awareness on SVEEP was also organised during which DC said that the programme aims to create a sense of responsibility among people towards their duty as citizens to participate in the electoral process. Later, the DC distributed various equipment among Swatch Grahis under Swachh Bharat Mission (G).","pubDate":"2023-05-24 22:22:30","image_url":null,"source_id":"dailyexcelsior","category":["top"],"country":["india"],"language":"english"},{"title":"Sat, Ashwani urge admn to sort out land compensation issues","link":"https://www.dailyexcelsior.com/sat-ashwani-urge-admn-to-sort-out-land-compensation-issues/","keywords":["State"],"creator":["Daily Excelsior"],"video_url":null,"description":"Excelsior Correspondent JAMMU, May 24: “Administration must take public issues seriously. The unwanted delay in providing compensation to the aggrieved is equal to the justice denied”, said Sat Sharma, former Housing & Urban Development Minister and senior BJP leader while listening to the deputation of people whose land have been acquired for the construction of approach road to 4th Tawi Bridge. Sat Sharma was particular about timely and fair compensation for acquired land. He was canvassing for land compensation of […] The post Sat, Ashwani urge admn to sort out land compensation issues appeared first on Jammu Kashmir Latest News | Tourism | Breaking News J&K.","content":"BJP leaders listening public grievances at party office Trikuta Nagar on Wednesday. Excelsior Correspondent JAMMU, May 24: “Administration must take public issues seriously. The unwanted delay in providing compensation to the aggrieved is equal to the justice denied”, said Sat Sharma, former Housing & Urban Development Minister and senior BJP leader while listening to the deputation of people whose land have been acquired for the construction of approach road to 4th Tawi Bridge. Sat Sharma was particular about timely and fair compensation for acquired land. He was canvassing for land compensation of people whose land had been taken over by various departments for execution of public projects. In addition, since decades, their land compensation files have been gathering dust in obscure shelves of offices. Sat Sharma, former BJP president and former Minister along with former MLA Ashwani Sharma, JMC councillor and BJP SC Morcha, Seh-Prabhari, Jeet Angral and BJP State Executive Member (SEM) Shailja Gupta listened to the public grievances at BJP Headquarters, Trikuta Nagar, here. While listening to their grievances, Sat Sharma (CA) added that it is the prime responsibility of the concerned department officials is to sort out the people’s issues in a time bound manner. The dilly dallying approach to all the issues is just undesirable and the administration must take needed steps to end the harassment of the people while reaching out to the people themselves. Ashwani Sharma said that the aggrieved masses are already facing hardships due to their respective issues must not be made to suffer on one pretext or another. BJP has initiated a channel where the party leaders dedicatedly meet the aggrieved on a daily basis. The masses can approach them to register their issues, which are immediately taken up by the senior BJP leaders with the concerned officials. Jeet Angral and Shailja Gupta diarized the issues and coordinated the camp proceedings. During the camp, people from different parts of Jammu & Kashmir visited the party office in the form of deputations to represent the issues of their respective areas as well as their individual concerns before the senior party leadership. The main issues presented were related to the Ration Card, verification of land titles, transformer issues, electric poles, streetlights, repair of lanes/ roads, job issues, etc. Listening to the various issues represented by the deputations, BJP leaders telephonically talked to the concerned departmental officials.","pubDate":"2023-05-24 22:20:00","image_url":null,"source_id":"dailyexcelsior","category":["top"],"country":["india"],"language":"english"},{"title":"Madhya Pradesh: Speaker tells officials to complete projects soon in Rewa","link":"https://www.freepressjournal.in/bhopal/madhya-pradesh-speaker-tells-officials-to-complete-projects-soon-in-rewa","keywords":["Bhopal News"],"creator":null,"video_url":null,"description":null,"content":"Rewa (Madhya Pradesh): Assembly Speaker Girish Gautam has directed the officials to complete the development projects sanctioned for Devtalabconstituency as early as possible. He made the statement in a meeting with the officials of the district administration at Rajniwas circuit house on Wednesday. Gautam also inspected the progress of construction work. Commissioner Anil Suchari, collector Pratibha Pal chief executive officer of the district Panchayat Saurabh Sonwane and BJP’s district president Ajay Singh were present during the inspection. Gautam said the construction of roads and bridges worth Rs 303 crore had been sanctioned for Devtalab. He said there should not be any relaxation in the work. Gautam directed the officials to complete the work before the rainy season, so that the people might not face any problem. According to the Speaker, the projects which have not yet started should begin before the monsoon. The Mauganj road construction should be immediately started and the Mangawan flyover project completed before September, he said. Gautam further said he would inspect the progress of work after a fortnight again to see whether his instructions were carried out. He was angry with the officials for not completing the Nal Jal projects in village areas. At the meeting, he directed the commissioner and the top officials of the construction agency to monitor the work.","pubDate":"2023-05-24 22:15:00","image_url":"https://gumlet.assettype.com/freepressjournal/2023-05/f0bb933e-1f0e-4ad3-91ab-e6ab0ced2bc4/pic1_Rewa.jpg","source_id":"freepressjournal","category":["top"],"country":["india"],"language":"english"},{"title":"Nvidia Shares Surge 21 Percent as Sales Forecast Jumps and AI Booms","link":"https://www.news18.com/tech/nvidia-shares-surge-21-percent-as-sales-forecast-jumps-and-ai-booms-7908421.html","keywords":["tech"],"creator":null,"video_url":null,"description":"The artificial-intelligence boom has helped Nvidia become the fifth-most valuable U.S. company by market value","content":"Nvidia Corp on Wednesday forecast second-quarter revenue more than 50% above Wall Street estimates, with the company saying it is boosting supply to meet surging demand for its artificial-intelligence chips, which are used to power ChatGPT and many similar services. Shares of Nvidia, the world’s most valuable listed semiconductor company, jumped as much as 21% to a record-high $370 in extended trade. Nvidia’s surge after the bell increased its stock market value by nearly $150 billion to more than $900 billion, extending the Silicon Valley company’s lead as the world’s most valuable semiconductor firm. The artificial-intelligence boom has helped Nvidia become the fifth-most valuable U.S. company by market value. Nvidia has strained to meet demand for its AI chips, with Tesla Inc Chief Executive Officer Elon Musk, who is reportedly building out an artificial-intelligence startup, earlier this week telling an interviewer that the graphics processing units (GPUs) are “considerably harder to get than drugs.\" But Nvidia Chief Executive Officer Jensen Huang on Wednesday said in a statement that the company is “significantly increasing our supply to meet surging demand\" for its data center chips. Analysts believe Nvidia reallocated some supply-chain capacity away from the slumping PC gaming market to its data center AI chips. Its PC gaming chips sell for as much as $1,500 while its AI chips fetch more than ten times that at about $20,000 each. Nvidia forecast current-quarter revenue of $11 billion, plus or minus 2%. Analysts polled by Refinitiv are expecting revenue of $7.15 billion. Adjusted revenue for the quarter ended April 30 was $7.19 billion. Analysts polled by Refinitiv were expecting revenue of $6.52 billion. The company’s data center chip sales hit $4.28 billion, beating analyst estimates of $3.89 billion, according to segment data from FactSet. Gaming chip revenue beat Wall Street expectations at $2.24 billion versus estimates of $1.97 billion, according to FactSet data. Net income rose to $2.04 billion, or 82 cents per share, from $1.62 billion, or 64 cents per share, a year earlier. Excluding items, the company earned $1.09 per share in the first quarter, beating estimates of 92 cents.","pubDate":"2023-05-24 21:44:38","image_url":"https://images.news18.com/ibnlive/uploads/2023/05/untitled-design-202-16849645643x2.png","source_id":"news18","category":["technology"],"country":["india"],"language":"english"},{"title":"TRON’s next target on the price charts is…","link":"https://ambcrypto.com/tron-smashes-past-key-resistance-the-next-target-is/","keywords":["Altcoin","Analysis","HideCryptopanic","News","News 1","No Homepage","Social","Trading View","Tron","Tron price analysis","TRX","TRX price prediction"],"creator":["Akashnath S"],"video_url":null,"description":"The CVD began to climb higher ten days ago after a pullback to $0.066, denoting strong demand behind TRX.","content":null,"pubDate":"2023-05-24 21:30:42","image_url":null,"source_id":"ambcrypto","category":["top"],"country":["india"],"language":"english"},{"title":"Madhya Pradesh: Most complaints at public hearing in Morena pertain to land","link":"https://www.freepressjournal.in/bhopal/madhya-pradesh-most-complaints-at-public-hearing-in-morena-pertain-to-land","keywords":["Bhopal News"],"creator":null,"video_url":null,"description":null,"content":"Morena (Madhya Pradesh): Commissioner of the Gwalior-Chambal division Deepak Singh heard 11 complaints on Tuesday and asked the officials to solve them. The complaints came up at a public hearing. A resident of Joura, Ramprakash, submitted an application seeking permission for construction of road on government land. The commissioner asked the official concerned to deal with the case. Another resident from Joura, Rewati, said the Patwari wrongly demarcated her land, despite an order of the high court. Singh directed the officials to solve the case. Similarly, a resident of Sabalgarh, Gopi Mahaur, gave an application for allotting the number for his land. A resident of the Munshi Ka Bagh area Ramsanehi demanded demarcation of his land and allotment of number for it. Sugreev, a resident of the Mouja area, said the Partwari and revenue inspector did not demarcate his land, although they had taken Rs 12,000 for the work from him. 185 plaints come up for hearing Nearly 185 applications came up for hearing at the collectorate on Tuesday. Collector Ankit Asthana along with other officials heard those complaints. Out of 185, plaints, 19 were kept for hearing in time-limit meeting. There were 164 problems which different departments could work out, so the collector directed the officials to send those complaints by post to those departments concerned. Chief executive officer of the district Panchayat IchhitGadhpale was also present at the public hearing. (To receive our E-paper on WhatsApp daily, please click here. To receive it on Telegram, please click here . We permit sharing of the paper's PDF on WhatsApp and other social media platforms.)","pubDate":"2023-05-24 21:14:00","image_url":"https://gumlet.assettype.com/freepressjournal/2023-01/4fddf990-a75d-45f5-8309-ad0e73a769de/court_order_Senjo.jpg","source_id":"freepressjournal","category":["top"],"country":["india"],"language":"english"}],"nextPage":"16849628408f4986c98dd0e2830bd3e6c05f37a14d"}